src/test/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:chick="urn:chicken:recipes">
    <soapenv:Header/>
    <soapenv:Body>
        <chick:getRecipeRequest>
            <chick:country>France</chick:country>
        </chick:getRecipeRequest>
    </soapenv:Body>
</soapenv:Envelope>